{
  "updated": "2026-02-18",
  "config": {
    "repoBaseUrl": "https://simonroberto.github.io/session-finder",
    "photosPath": "/photos"
  },
  "categories": [
    {
      "id": "fam-jam",
      "title": "FAM™JAM",
      "description": "Dance and movement therapy sessions",
      "icon": "💃",
      "sortOrder": 10,
      "members": [
        "zoe-taylor",
        "brianna-king",
        "havana-beal",
        "grace-dunn"
      ]
    },
    {
      "id": "fam-tui",
      "title": "FAM™TŪI",
      "description": "Specialized physiotherapy programs",
      "icon": "🫀",
      "sortOrder": 20,
      "members": [
        "merryn-robertson",
        "michael-hynard"
      ]
    },
    {
      "id": "fam-program",
      "title": "FAM™Program",
      "description": "Classes and personal training sessions",
      "icon": "💪",
      "sortOrder": 30,
      "members": [
        "michael-hynard",
        "becca-percy",
        "diogo-freire",
        "karla-granville",
        "yuan-pu",
        "renee-thornley",
        "connor-dann",
        "naomi-render",
        "awat-kakai",
        "samantha-glenny",
        "ollie-smith",
        "nadja-kumerich",
        "havana-beal",
        "kieran-cordelle",
        "shaney-olivier",
        "mike-hardgrave",
        "jacqueline-hay"
      ]
    },
    {
      "id": "operations",
      "title": "Operations",
      "description": "Leadership and operational support",
      "icon": "⚙️",
      "sortOrder": 40,
      "members": [
        "michael-hynard",
        "robert-simon"
      ]
    }
  ],
  "teams": [
    {
      "name": "Michael Hynard",
      "role": "CEO / Founder",
      "email": "info@functionaladaptivemovement.com",
      "photo": "michael-hynard.jpg",
      "bio": "Michael's journey in the realm of health and fitness isn't just a career; it's a profound calling and a heartfelt passion deeply rooted in a personal connection. In 1996, Michael's daughter Siobhan, only one year old at the time, received a life-altering diagnosis of Cerebral Palsy and other conditions. This moment ignited a resolute sense of purpose within Michael. Inspired by his own experiences, Michael founded the FAM™ Program. He believes that success in this field requires a collaborative approach, especially for those with special needs. Michael collaborates with specialists from various fields to ensure the program serves athletes comprehensively. Michael is an AdaptX-Certified Inclusive and Adaptive Fitness Coach, an ATA (Adaptive Training Academy) certified Adaptive & Inclusive Trainer, and a national martial arts champion. He also holds a CrossFit Level 2 trainer designation and a 1st Dan in traditional Jiu Jitsu. Before founding FAM™, Michael gained experience in the corporate sector as a salesperson and sales & leadership coach. These experiences honed his adaptability and people skills. Clients describe Michael as enthusiastic, profoundly knowledgeable, impeccably professional, and exceptionally motivating. His commitment to enriching lives is unwavering and humbling. Michael is the first recipient of the inaugural Sir Murray Halberg Legacy Award presented at the 62nd ISPS Handa Halberg Awards 2025. This award honours those individuals whose contributions have made a lasting impact on disability sport in Aotearoa, continuing Sir Murray's vision of inclusion and empowerment.",
      "location": "Auckland",
      "sortOrder": 1,
      "id": "michael-hynard"
    },
    {
      "name": "Karla Granville",
      "role": "FAM™ Coach",
      "email": "karla@functionaladaptivemovement.com",
      "photo": "karla-granville.jpg",
      "bio": "Kia Ora ! After having worked in several operational management roles in the hospitality industry, I completed a BSR in Sport and Exercise Science & Nutrition, this has allowed me to gain an academic and professional focus of functional fitness. Programming movement for the body and mind results in increased overall strength and wellbeing, FAM™ facilitates this through inclusive group exercise and one on one training sessions which then quickly brings about enhanced happiness, and improves quality of life. My time with FAM™ began as a Volunteer, gradually following with becoming a Coach, and now I'm grateful to be working with Michael to help improve and extend the FAM™ programs in an operational management role. With research, education, and support for our team of coaches, collectively we will find ways to continue championing inclusion, adaptation, and accessibility for all in safe and supportive environments.",
      "location": "Auckland",
      "sortOrder": 2,
      "id": "karla-granville"
    },
    {
      "name": "Merryn Robertson",
      "role": "Lead Physio FAM™Tūi",
      "email": "merryn@functionaladaptivemovement.com",
      "photo": "merryn-robertson.jpg",
      "bio": "Merryn is a highly experienced physiotherapist with over 20 years of dedication to helping children reach their full physical potential. Originally trained in South Africa, she earned her Master's in Physiotherapy before relocating to New Zealand in 2009. A Bobath trained therapist since 2006, Merryn has worked across diverse settings, including preschools, schools, private clinics, hospitals, and family homes. Passionate about fostering movement, confidence, and well-being, Merryn collaborates closely with families and the team to support each child's unique journey. She is a strong advocate for pain-free growth and building strong, healthy bodies from an early age. Committed to excellence, she continuously refines her practice through ongoing learning, international evidence-based approaches, and regular peer reviews-ensuring every child receives the highest standard of care.",
      "location": "Auckland",
      "sortOrder": 3,
      "id": "merryn-robertson"
    },
    {
      "name": "Renee Thornley",
      "role": "FAM™ Coach",
      "email": "renee@functionaladaptivemovement.com",
      "photo": "renee-thornley.jpg",
      "bio": "Kia Ora, My name is Renee, and I've recently completed my Bachelor of Sport and Recreation, minoring in Sports Science. In 2024, I was fortunate to complete a year-long placement with FAM™, where I found my passion for the adaptive fitness industry. Since finishing my degree, I've returned to the \"naughty north\" (Whangarei), where I grew up, to lead FAM™'s Whangarei location. I'm excited to use my knowledge to create inclusive, fun, and effective fitness environments that empower individuals of all abilities to move, grow, and thrive. My goal is to build a welcoming community where everyone feels supported and celebrated on their journey. When I'm not coaching, you'll find me exploring the Northland outdoors, walking my dog, hanging out with my family and friends, or attending one of many concerts.",
      "location": "Auckland",
      "sortOrder": 4,
      "id": "renee-thornley"
    },
    {
      "name": "Naomi Render",
      "role": "FAM™ Coach",
      "email": "naomi@functionaladaptivemovement.com",
      "photo": "naomi-render.jpg",
      "bio": "Kia ora Team! I'm a small part of the talented FAM™ coaching sector in Auckland, providing classes and 1:1 sessions. I joined for work experience in 2024 as part of my Personal Training certificate, and enjoyed the vibes so much I decided to stay on. My favourite thing about FAM™ is that we meet you where you are at and push you to achieve the things that profoundly improve day to day life, whether you think you can achieve them or not! I love seeing people leave with a massive smile after doing something they didn't think they could do. Our community is strong, and our belief is stronger. Alongside my PT work I am applying for a career in fire fighting, I love to surf (badly) and be anywhere close to the beach, try new recipes in the kitchen and hang out in the gym or on the tennis court. See ya soon!",
      "location": "Auckland",
      "sortOrder": 5,
      "id": "naomi-render"
    },
    {
      "name": "Connor Dann",
      "role": "FAM™ Coach",
      "email": "connor@functionaladaptivemovement.com",
      "photo": "connor-dann.jpg",
      "bio": "My name is Connor and I am a graduated sport and exercise science major who has been working in the disability sector for the past three years. I used to work at ParaFed Otago which is where I found my love for adaptive sport. Right now, I also work at Laura Fergusson Brain Injury Trust as a rehabilitation coach and continue to be actively involved in the disability sector. In my spare time, I coach women's football and love to get out in nature, usually through trail running. I couldn't be happier to be involved with FAM™ and I hope to see you in the gym soon!",
      "location": "Dunedin",
      "sortOrder": 6,
      "id": "connor-dann"
    },
    {
      "name": "Yuan Pu",
      "role": "FAM™ Coach",
      "email": "yuan@functionaladaptivemovement.com",
      "photo": "yuan-pu.jpg",
      "bio": "I'm Yuan. I finished my BSR, Bachelor of Science in Exercise Science and Nutrition. I enjoy discovering people's different strengths through daily training to help them improve their strength, skills and self-efficacy more effectively. In addition to this, being active in training and experimenting with different cuisines is what makes me happiest outside of work and I aim to share this with my friends by associating food with an active and healthy lifestyle!",
      "location": "Auckland",
      "sortOrder": 7,
      "id": "yuan-pu"
    },
    {
      "name": "Kate Maloney",
      "role": "FAM™ Coach",
      "email": "kate@functionaladaptivemovement.com",
      "photo": "kate-maloney.jpg",
      "bio": "Kia Ora, m y name is Kate, and I am a BSc (physiology) graduate, starting my Master of Physiotherapy Practice in 2025. Between my undergraduate studies and before beginning my master's, I have been working in the private residence of a young girl with cerebral palsy as one of her support workers. This is how I got introduced to the absolutely incredible community that is FAM™. My experience as a support worker has been invaluable in recognising the ability in disability. I am a massive advocate for inclusivity and creating a safe space where the people I work with feel valued and understood. This is something that I immediately noticed with the team at FAM™, and I aim to bring this level of positivity and encouragement to everyone. On the rare occasion you find me not coaching or studying, you'll either find me outside at the beach, running, or sitting with my head in a book! I'm super excited to bring my expertise and enthusiasm to this role where not only physical fitness goals can be fulfilled but where there's a space to have a good laugh and leave with a smile on all of our faces.",
      "location": "Auckland",
      "sortOrder": 8,
      "id": "kate-maloney"
    },
    {
      "name": "Shaney Olivier",
      "role": "FAM™ Coach",
      "email": "shaney@functionaladaptivemovement.com",
      "photo": "shaney-olivier.jpg",
      "bio": "Heyaa !! I'm Shaney, and I'm so excited to be part of the amazing team at FAM™ here in Christchurch. My journey into adaptive fitness began when I volunteered with Riding for the Disabled, where I first saw how powerful movement could be in building confidence and connection. That experience sparked a fire in me to help people of all abilities feel seen, supported, and strong in their own bodies. From there, I worked as a caregiver before pursuing my Personal Training studies. Throughout my journey, one thing has always stayed the same: my belief that fitness is for every body-and that the gym should be a safe, uplifting space where people can grow, move, and thrive at their own pace. My coaching style is all about support, encouragement, and celebrating the small wins that make a big difference. I'm passionate about helping athletes feel good about themselves both physically and mentally, and I love seeing people surprise themselves with what they're capable of. Outside of coaching, I'm always up for trying new things-whether it's hiking, baking, journaling, or reorganising my entire life just for fun. I can't wait to walk alongside you in your fitness journey and help you feel strong, capable, and empowered every step of the way. Let the journey begin !!",
      "location": "Auckland",
      "sortOrder": 9,
      "id": "shaney-olivier"
    },
    {
      "name": "Diogo Freire",
      "role": "FAM™ Coach",
      "email": "diogo@functionaladaptivemovement.com",
      "photo": "diogo-freire.jpg",
      "bio": "Diogo is a Strength and Movement coach who is passionate about working with people to develop their skills, strength and confidence in everyday tasks. Through his experience coaching kids and adults, he focuses on where his clients are at and helping them enjoy the small incremental wins a good process brings. He takes his work seriously, all the while not taking himself too seriously - he believes that having fun, some banter and connecting with people is paramount for an enjoyable workout (and life, isn't it?). When not working with his clients, he's likely to be practicing Olympic Weightlifting (his sport/obsession of choice) or doing some core strengthening as his two young boys use him as a human trampoline.",
      "location": "Tauranga",
      "sortOrder": 10,
      "id": "diogo-freire"
    },
    {
      "name": "Awat Kakai",
      "role": "FAM™ Coach",
      "email": "awat@functionaladaptivemovement.com",
      "photo": "awat-kakai.jpg",
      "bio": "Hey everyone! I'm Awat - a physiotherapy student with an interest in neurological rehabilitation. My journey at FAM began on placement during my studies where I found a passion for adaptive coaching. I was inspired by the fulfilling FAM environment to stay on and volunteer which lead to coaching. Just like the rest of the amazing FAM crew, I strive to nurture the empowering, positive environment we create for the community. I love supporting each individual's unique journey in achieving their goals, celebrating every milestone along the way, and seeing the smiles that reflect confidence and discovering what is possible. Outside of coaching and studying, you'll find me on spontaneous adventures exploring NZ and chasing sunsets (always with my apple juice!)",
      "location": "Auckland",
      "sortOrder": 11,
      "id": "awat-kakai"
    },
    {
      "name": "Samantha Glenny",
      "role": "FAM™ Coach",
      "email": "samantha@functionaladaptivemovement.com",
      "photo": "samantha-glenny.jpg",
      "bio": "Hi everyone, My name is Samantha. I have graduated with a degree in biomedical science and am currently completing a physiotherapy degree. During my studies, I had a placement at FAM™, where I became very inspired by their work. I continued as a volunteer before eventually becoming a coach. My first experience with disability was growing up with my older brother Isaac, who is autistic. This has given me a unique understanding and a strong desire to make a difference in the disability sector. Through coaching at FAM™, I am excited to utilise my knowledge and passion to positively impact the lives of each individual client, based on their goals and aspirations. When I'm not coaching, I love spending time at the beach, trying to be a runner, creating new recipes in the kitchen, and going on adventures with my friends.",
      "location": "Auckland",
      "sortOrder": 12,
      "id": "samantha-glenny"
    },
    {
      "name": "Zoe Taylor",
      "role": "FAM™ Jam Coach",
      "email": "zoe@functionaladaptivemovement.com",
      "photo": "zoe-taylor.jpg",
      "bio": "Kia ora everyone! I am a passionate dance teacher dedicated to creating inclusive, supportive environments where individuals of all abilities can thrive. My journey in dance began at 15, where I relocated to Christchurch to pursue dancing full time. Through this I was fortunate enough to perform in Melbourne, Prague, New York, and tour through the South Island. After my dance career, I transitioned into early childhood education and discovered an immense calling for working with children with additional needs. This led me to pursue a bachelor's degree in teaching, with the intention of specializing in special education. With my qualifications in dance, special education, and early childhood education, I'm committed to fostering equitable environments where everyone can reach their full potential. I'm thrilled to be part of the FAM Jam team, empowering people to express themselves through movement and music-based therapy. I believe in creating a safe space where individuals can explore their social, emotional, and physical development, and I'm proud to offer a space where every dancer has the opportunity to grow and thrive. I'm incredibly grateful for the chance to help launch the first FAM Jam workshop in my hometown of Kerikeri, where I can combine my passions for dance and creating inclusive environments.",
      "location": "Kerikeri",
      "sortOrder": 14,
      "id": "zoe-taylor"
    },
    {
      "name": "Grace Dunn",
      "role": "FAM™ Jam Coach",
      "email": "grace@functionaladaptivemovement.com",
      "photo": "grace-dunn.jpg",
      "bio": "Hi everyone! My name is Grace, and I am a dance teacher from West Auckland. My passion for dance began at 3 years old when I was first put into preschool classes. I have studied many styles over the years, including ballet, jazz, tap, hip hop, lyrical, and contemporary. Since then, my love of dance has continued to grow, and I eventually found my passion for teaching. I enjoy combining the technical and creative sides of dance, teaching strong foundations and technique, while also promoting creativity from my students. My aim is to support and encourage students to communicate their ideas or feelings through dance. I have recently graduated with a Bachelor of Science in Medicinal Chemistry from The University of Auckland. This degree helped develop my knowledge and understanding of the human body, and further grew my interest in the health field. It has encouraged me to teach my students healthy habits and safe techniques, to support their growth and strength for dance. My biggest inspirations have been my past dance teachers, and I want to continue to share my knowledge with all of my students. I am very excited to be apart of the FAM JAM team, and continue to help people use dance and movement as a creative outlet.",
      "location": "Auckland",
      "sortOrder": 14.1,
      "id": "grace-dunn"
    },
    {
      "name": "Ollie Smith",
      "role": "FAM™ Coach",
      "email": "ollie@functionaladaptivemovement.com",
      "photo": "ollie-smith.jpg",
      "bio": "Kia Ora, my name is Ollie. I am currently finishing off a Bachelor in Sports and Exercise Science at Ara. Prior to this I have completed 2 diplomas at the New Zealand Institute of Sport. (NZIS) I have right-sided hemiplegia which causes the right side of my body to be weaker, making me slightly less mobile and I have reduced fine motor skills. To compensate for this, I attend the gym regularly to strengthen the right side of my body making the muscle imbalances less evident. Along the journey I have established a real passion for health and fitness. Living this lifestyle has inspired me to motivate others to push themselves to their limits, not only in the gym setting. In May 2024 I got in touch with FAM™ enquiring about voluntary opportunities and a few weeks later I was assisting to run the classes in Christchurch. I really enjoy watching people improve their strength and fitness and love helping out where I can at FAM™. I am continuously improving my skills as a coach and can't wait to see what the future holds for me here at FAM™!",
      "location": "Christchurch",
      "sortOrder": 14,
      "id": "ollie-smith"
    },
    {
      "name": "Nadja Kumerich",
      "role": "FAM™ Coach",
      "email": "nadja@functionaladaptivemovement.com",
      "photo": "nadja-kumerich.jpg",
      "bio": "Hi everyone, my name is Nadja Kumerich. I'm in my second year studying a Bachelor of Sport and Recreation majoring in coaching. I am a high-performance athlete in athletics as a hammer thrower and have even been privileged enough to represent my country internationally. My love and passion for working with athletes with disabilities came from my former athletics coach, John Eden, who was a 5-time paralympian and has helped me develop and grow my knowledge in this space. I helped coach the athletics session at the Halberg Games this year, as well as helped run Para Athletics \"Have a Go\" days with Athletics New Zealand throughout the year, allowing athletes to explore the sport of athletics. My coaching philosophy has always been that everyone, regardless of disability, deserves the opportunity to learn and grow in sport, so when I first heard about FAM™, I knew I had to jump at this opportunity. I can't wait to see so many smiling faces around, and I am very excited to get stuck in.",
      "location": "Auckland",
      "sortOrder": 15,
      "id": "nadja-kumerich"
    },
    {
      "name": "Brianna King",
      "role": "FAM™ Jam Coach",
      "email": "briana@functionaladaptivemovement.com",
      "photo": "brianna-king.jpg",
      "bio": "Brianna is a professional dancer and an Occupational Therapy student with a rich background in teaching and performing across New Zealand and abroad. Trained in contemporary, jazz, hip hop, ballet, and commercial dance-and having toured with Royal Caribbean Cruise Lines-she brings a rare blend of technical skill, warmth, and lived experience to every class. Her passion is using movement to spark confidence, connection, and genuine wellbeing. She's dedicated to creating spaces where people of all abilities feel seen, supported, and able to express themselves fully. Alongside her professional path, Brianna is also a devoted carer for a young man living with disabilities in New Zealand. This role deepens her commitment to inclusivity and shapes her belief that dance can be a powerful tool for empowerment, communication, and joy. Brianna's teaching is grounded, compassionate, and full of heart-an invitation for everyone to shine.",
      "location": "Auckland",
      "sortOrder": 14.2,
      "id": "brianna-king"
    },
    {
      "name": "Kieran Cordelle",
      "role": "FAM™ Coach",
      "email": "kieran@functionaladaptivemovement.com",
      "photo": "kieran-cordelle.png",
      "bio": "Hi, I'm Kieran Cordelle, an adaptive strength and conditioning coach passionate about helping people move with confidence, capability, and purpose. I hold a Bachelor's degree in Sport and Exercise Science from AUT, where I discovered my passion for adaptive training. I bring a strong foundation in sport science, athlete development, and inclusive coaching to my work at Functional Adaptive Movement. I have hands-on experience delivering strength, conditioning, and skill-development programmes for athletes across a range of sports and abilities. At FAM™, my focus is on creating training environments where individuals feel supported, challenged, and empowered, while still having fun. I take a person-centred approach, ensuring goals, communication, and programming are tailored to each athlete. Outside of FAM, I'm passionate about football, surfing, and mountain biking. I'm motivated by seeing people achieve things they didn't think were possible and contributing to a more inclusive, accessible, and empowering sporting community.",
      "location": "Auckland",
      "sortOrder": 17,
      "id": "kieran-cordelle"
    },
    {
      "name": "Havana Beal",
      "role": "FAM™ Coach",
      "email": "havana@functionaladaptivemovement.com",
      "photo": "havana-beal.png",
      "bio": "Kia Orana everyone, I am Havana. I have recently graduated with a Bachelor of Sport & Recreation, majoring in Sport and Exercise Science at Auckland University of Technology. My journey with FAM™ began through my co-op placement, where I was inspired by the organisation's commitment to inclusion, adaptation, and empowering individuals of all abilities through movement. Alongside my academic background, I have a strong foundation in dance. I grew up dancing in Australia, training across multiple styles, which eventually led me to New Zealand where I joined the Royal Family Dance Crew. This experience shaped my understanding of movement as expression, connection, and wellbeing, and continues to influence my approach to adaptive and inclusive movement. During my time at FAM™, I have worked alongside an incredible team of coaches, supported adaptive strength and conditioning sessions, and contributed to inclusive community initiatives. I am passionate about using sport and exercise science to enhance physical capacity, confidence, and quality of life, and I am grateful to be part of a team that champions inclusion and challenges traditional approaches to fitness and performance.",
      "location": "Auckland",
      "sortOrder": 18,
      "id": "havana-beal"
    },
    {
      "name": "Dr Robert Simon",
      "role": "CIO",
      "email": "robert@functionaladaptivemovement.com",
      "photo": "dr-robert-simon.jpg",
      "bio": "Kia ora, I'm Robert. I support FAM™ as CIO because I care deeply about the people behind the work and the difference our organisation makes. I bring more than two decades of experience designing enterprise systems and improving how teams run day to day. At FAM™™, I focus on simple digital tools that help clients, caregivers, coaches and volunteers stay connected with sessions and updates. I value clear processes and small improvements that reduce stress for everyone. I also bring a strong personal focus on resilience and wellbeing, and I apply that in how I engage and how I design systems. My goal is steady progress: reliable operations, useful data, and a client experience that feels safe, simple and human.",
      "location": "Auckland",
      "sortOrder": 19,
      "id": "robert-simon"
    },
    {
      "name": "Jacqueline Hay",
      "role": "FAM™ Coach",
      "email": "jacqueline@functionaladaptivemovement.com",
      "photo": "jacqueline-hay.png",
      "bio": "Kia ora koutou, ko Jax ahau. Along with my coaching peers here at FAM™, I share a great passion for helping people improve their overall well-being. Starting as a casual volunteer at FAM™ in 2019 during my undergraduate studies, I was influenced to learn more about how I could be more serviceable for individuals living with varied capabilities and conditions to be more active. I discovered how I could apply innovative and creative thinking for adaptive training... and I like to think my creativity stems a lot from my love for painting and drawing, too. I grew an eagerness to build my knowledge of the pathophysiology of conditions and exercise responses, and my skills in helping people manage their condition/s through exercise, which were further developed through my Master's studies in Clinical Exercise Physiology. I strive to make athletes and clients feel safe in their exercise and to have a good giggle during their sessions, too, of course! Outside of this area of my life, I do art, read, spend time with my two goofy cats, and I am a student of traditional martial arts. After my studies, I moved to Tauranga Moana to reconnect with my whaanau and spend more time in the taiao. I am super excited for the FAMily to grow in this area of Aotearoa and help people live a more active lifestyle. Catch ya later!",
      "location": "Tauranga",
      "sortOrder": 20,
      "id": "jacqueline-hay"
    },
    {
      "name": "Mike Hardgrave",
      "role": "FAM™ Coach",
      "email": "mike@functionaladaptivemovement.com",
      "photo": "mike-hardgrave.png",
      "bio": "About Mike",
      "location": "Auckland",
      "sortOrder": 21,
      "id": "mike-hardgrave"
    },
    {
      "name": "Becca Percy",
      "role": "FAM™ Coach",
      "email": "",
      "photo": "becca-percy.jpg",
      "bio": "Hey FAM, me again! I was lucky enough to start volunteering on my AUT placement back in 2018. This quickly progressed into a professional coaching path, which was backed by my BSR in Exercise Science and Coaching. This career included running my own Health Coaching business, specialising in Movement Therapy, Stress Management and CrossFit, all alongside PTing and class coaching with FAM™. Following a pause from FAM™ in 2022 and a year of global travel in 2024, I've now found myself based in Bristol, working alongside Vivobarefoot. Coaching has always been a vehicle to dismantle limitations and live as the person you believe you are, giving your life more texture. When you're in my sessions, you'll get a lot of giggles, a lot of energy, a few dance moves and a big sweat (obviously hundreds of high-fives too)!",
      "location": "Bristol, UK",
      "sortOrder": 22,
      "id": "becca-percy"
    },
    {
      "name": "Grace Dunn",
      "role": "FAM™ Jam Coach",
      "email": "grace@functionaladaptivemovement.com",
      "photo": "grace-dunn.jpg",
      "bio": "Hi everyone! My name is Grace, and I am a dance teacher from West Auckland. My passion for dance began at 3 years old when I was first put into preschool classes. I have studied many styles over the years, including ballet, jazz, tap, hip hop, lyrical, and contemporary. Since then, my love of dance has continued to grow, and I eventually found my passion for teaching. I enjoy combining the technical and creative sides of dance, teaching strong foundations and technique, while also promoting creativity from my students. My aim is to support and encourage students to communicate their ideas or feelings through dance. I have recently graduated with a Bachelor of Science in Medicinal Chemistry from The University of Auckland. This degree helped develop my knowledge and understanding of the human body, and further grew my interest in the health field. It has encouraged me to teach my students healthy habits and safe techniques, to support their growth and strength for dance. My biggest inspirations have been my past dance teachers, and I want to continue to share my knowledge with all of my students. I am very excited to be apart of the FAM JAM team, and continue to help people use dance and movement as a creative outlet.",
      "location": "Auckland",
      "sortOrder": 14,
      "id": "grace-dunn"
    }
  ]
}
